Ran Plan for 2 projects:

1. project: `production` dir: `deployment/prod/terraform` workspace: `default`
1. project: `development` dir: `deployment/dev/terraform` workspace: `default`

### 1. project: `production` dir: `deployment/prod/terraform` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis/bin/terraform1.7.0 plan -input=false -refresh -out \"/atlantis/repos/broadinstitute/backstage/1/default/deployment/prod/terraform/production-default.tfplan\"" in "/atlantis/repos/broadinstitute/backstage/1/default/deployment/prod/terraform": exit status 1
data.google_client_config.current: Reading...
data.google_project.current: Reading...
data.google_client_config.current: Read complete after 0s [id=projects/"bits-backstage-prod"/regions/"us-east4"/zones/<null>]
module.postgres.data.google_compute_zones.available[0]: Reading...
data.google_project.current: Read complete after 1s [id=projects/bits-backstage-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_project_iam_member.sa-access will be created
  + resource "google_project_iam_member" "sa-access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:devnull-sa@broadinstitute.org"
      + project = "bits-backstage-prod"
      + role    = "roles/owner"
    }

  # google_project_iam_member.team-access will be created
  + resource "google_project_iam_member" "team-access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:devnull@broadinstitute.org"
      + project = "bits-backstage-prod"
      + role    = "roles/editor"
    }

  # google_project_service.api_services["cloudidentity.googleapis.com"] will be created
  + resource "google_project_service" "api_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "bits-backstage-prod"
      + service                    = "cloudidentity.googleapis.com"
    }

  # google_project_service.api_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "api_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "bits-backstage-prod"
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.api_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "api_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "bits-backstage-prod"
      + service                    = "iam.googleapis.com"
    }

  # google_project_service.api_services["iamcredentials.googleapis.com"] will be created
  + resource "google_project_service" "api_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "bits-backstage-prod"
      + service                    = "iamcredentials.googleapis.com"
    }

  # google_project_service.api_services["iap.googleapis.com"] will be created
  + resource "google_project_service" "api_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "bits-backstage-prod"
      + service                    = "iap.googleapis.com"
    }

  # google_project_service.api_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "api_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "bits-backstage-prod"
      + service                    = "monitoring.googleapis.com"
    }

  # google_project_service.api_services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "api_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "bits-backstage-prod"
      + service                    = "secretmanager.googleapis.com"
    }

  # google_project_service.api_services["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "api_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "bits-backstage-prod"
      + service                    = "sqladmin.googleapis.com"
    }

  # google_project_service.api_services["sts.googleapis.com"] will be created
  + resource "google_project_service" "api_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "bits-backstage-prod"
      + service                    = "sts.googleapis.com"
    }

  # google_service_account_iam_member.db-workload-identity will be created
  + resource "google_service_account_iam_member" "db-workload-identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:bits-gke-clusters.svc.id.goog[backstage/backstage]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.db-service-accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/cloudsql.client"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "bits-backstage-prod"
      + role    = "roles/cloudsql.client"
    }

  # module.db-service-accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/cloudsql.instanceUser"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "bits-backstage-prod"
      + role    = "roles/cloudsql.instanceUser"
    }

  # module.db-service-accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "bits-backstage-prod"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.db-service-accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/monitoring.metricWriter"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "bits-backstage-prod"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.db-service-accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/monitoring.viewer"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "bits-backstage-prod"
      + role    = "roles/monitoring.viewer"
    }

  # module.db-service-accounts.google_service_account.service_accounts["backstage"] will be created
  + resource "google_service_account" "service_accounts" {
      + account_id   = "backstage"
      + description  = "service account for CloudSQL access"
      + disabled     = false
      + display_name = "Terraform-managed service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "bits-backstage-prod"
      + unique_id    = (known after apply)
    }

  # module.postgres.google_sql_database.default[0] will be created
  + resource "google_sql_database" "default" {
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "backstage-prod"
      + name            = "backstage"
      + project         = "bits-backstage-prod"
      + self_link       = (known after apply)
    }

  # module.postgres.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "backstage-prod"
      + private_ip_address             = (known after apply)
      + project                        = "bits-backstage-prod"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "us-east4"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "ZONAL"
          + connector_enforcement       = "NOT_REQUIRED"
          + deletion_protection_enabled = false
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 10
          + disk_type                   = "PD_SSD"
          + edition                     = "ENTERPRISE"
          + pricing_plan                = "PER_USE"
          + tier                        = "db-f1-micro"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + enabled                        = false
              + point_in_time_recovery_enabled = false
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)
            }

          + database_flags {
              + name  = "cloudsql.iam_authentication"
              + value = "on"
            }

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = false
              + ipv4_enabled                                  = true
              + require_ssl                                   = true
              + ssl_mode                                      = (known after apply)
            }

          + maintenance_window {
              + day          = 1
              + hour         = 23
              + update_track = "canary"
            }
        }

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + update = "30m"
        }
    }

  # module.postgres.google_sql_user.iam_account["backstage"] will be created
  + resource "google_sql_user" "iam_account" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "backstage-prod"
      + name                    = (known after apply)
      + project                 = "bits-backstage-prod"
      + sql_server_user_details = (known after apply)
      + type                    = (known after apply)
    }

  # module.postgres.null_resource.module_depends_on will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "0"
        }
    }

  # module.postgres.random_password.user-password will be created
  + resource "random_password" "user-password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "backstage-prod"
        }
      + length      = 32
      + lower       = true
      + min_lower   = 1
      + min_numeric = 1
      + min_special = 0
      + min_upper   = 1
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 23 to add, 0 to change, 0 to destroy.
╷
│ Error: googleapi: Error 403: Compute Engine API has not been used in project bits-backstage-prod before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/compute.googleapis.com/overview?project=bits-backstage-prod then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry.
│ Details:
│ [
│   {
│     "@type": "type.googleapis.com/google.rpc.Help",
│     "links": [
│       {
│         "description": "Google developers console API activation",
│         "url": "https://console.developers.google.com/apis/api/compute.googleapis.com/overview?project=bits-backstage-prod"
│       }
│     ]
│   },
│   {
│     "@type": "type.googleapis.com/google.rpc.ErrorInfo",
│     "domain": "googleapis.com",
│     "metadatas": {
│       "consumer": "projects/bits-backstage-prod",
│       "service": "compute.googleapis.com"
│     },
│     "reason": "SERVICE_DISABLED"
│   }
│ ]
│ , accessNotConfigured
│ 
│   with module.postgres.data.google_compute_zones.available[0],
│   on .terraform/modules/postgres/modules/postgresql/read_replica.tf line 25, in data "google_compute_zones" "available":
│   25: data "google_compute_zones" "available" {
│ 
╵


```
</details>

---
### 2. project: `development` dir: `deployment/dev/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.google_project.current: Reading...
data.google_project.current: Read complete after 0s [id=projects/bits-backstage-dev]
module.postgres.data.google_compute_zones.available[0]: Reading...
module.postgres.data.google_compute_zones.available[0]: Read complete after 0s [id=projects/bits-backstage-dev/regions/us-east4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_project_iam_member.sa-access will be created
+ resource "google_project_iam_member" "sa-access" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "group:devnull-sa@broadinstitute.org"
+       project = "bits-backstage-dev"
+       role    = "roles/owner"
    }

  # google_project_iam_member.team-access will be created
+ resource "google_project_iam_member" "team-access" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "group:devnull@broadinstitute.org"
+       project = "bits-backstage-dev"
+       role    = "roles/editor"
    }

  # google_service_account_iam_member.db-workload-identity will be created
+ resource "google_service_account_iam_member" "db-workload-identity" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       member             = "serviceAccount:bits-gke-clusters-dev.svc.id.goog[backstage/backstage]"
+       role               = "roles/iam.workloadIdentityUser"
+       service_account_id = (known after apply)
    }

  # module.db-service-accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/cloudsql.client"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-dev"
+       role    = "roles/cloudsql.client"
    }

  # module.db-service-accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/cloudsql.instanceUser"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-dev"
+       role    = "roles/cloudsql.instanceUser"
    }

  # module.db-service-accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/iam.serviceAccountTokenCreator"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-dev"
+       role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.db-service-accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/monitoring.metricWriter"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-dev"
+       role    = "roles/monitoring.metricWriter"
    }

  # module.db-service-accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/monitoring.viewer"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-dev"
+       role    = "roles/monitoring.viewer"
    }

  # module.db-service-accounts.google_service_account.service_accounts["backstage"] will be created
+ resource "google_service_account" "service_accounts" {
+       account_id   = "backstage"
+       description  = "service account for CloudSQL access"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       member       = (known after apply)
+       name         = (known after apply)
+       project      = "bits-backstage-dev"
+       unique_id    = (known after apply)
    }

  # module.postgres.google_sql_database.default[0] will be created
+ resource "google_sql_database" "default" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-dev"
+       name            = "backstage"
+       project         = "bits-backstage-dev"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database_instance.default will be created
+ resource "google_sql_database_instance" "default" {
+       available_maintenance_versions = (known after apply)
+       connection_name                = (known after apply)
+       database_version               = "POSTGRES_15"
+       deletion_protection            = false
+       dns_name                       = (known after apply)
+       encryption_key_name            = (known after apply)
+       first_ip_address               = (known after apply)
+       id                             = (known after apply)
+       instance_type                  = (known after apply)
+       ip_address                     = (known after apply)
+       maintenance_version            = (known after apply)
+       master_instance_name           = (known after apply)
+       name                           = "backstage-dev"
+       private_ip_address             = (known after apply)
+       project                        = "bits-backstage-dev"
+       psc_service_attachment_link    = (known after apply)
+       public_ip_address              = (known after apply)
+       region                         = "us-east4"
+       self_link                      = (known after apply)
+       server_ca_cert                 = (sensitive value)
+       service_account_email_address  = (known after apply)

+       settings {
+           activation_policy           = "ALWAYS"
+           availability_type           = "ZONAL"
+           connector_enforcement       = "NOT_REQUIRED"
+           deletion_protection_enabled = false
+           disk_autoresize             = true
+           disk_autoresize_limit       = 0
+           disk_size                   = 10
+           disk_type                   = "PD_SSD"
+           edition                     = "ENTERPRISE"
+           pricing_plan                = "PER_USE"
+           tier                        = "db-f1-micro"
+           user_labels                 = (known after apply)
+           version                     = (known after apply)

+           backup_configuration {
+               enabled                        = false
+               point_in_time_recovery_enabled = false
+               start_time                     = (known after apply)
+               transaction_log_retention_days = (known after apply)
            }

+           database_flags {
+               name  = "cloudsql.iam_authentication"
+               value = "on"
            }

+           ip_configuration {
+               enable_private_path_for_google_cloud_services = false
+               ipv4_enabled                                  = true
+               require_ssl                                   = true
+               ssl_mode                                      = (known after apply)
            }

+           maintenance_window {
+               day          = 1
+               hour         = 23
+               update_track = "canary"
            }
        }

+       timeouts {
+           create = "30m"
+           delete = "30m"
+           update = "30m"
        }
    }

  # module.postgres.google_sql_user.default[0] will be created
+ resource "google_sql_user" "default" {
+       host                    = (known after apply)
+       id                      = (known after apply)
+       instance                = "backstage-dev"
+       name                    = "backstage"
+       password                = (sensitive value)
+       project                 = "bits-backstage-dev"
+       sql_server_user_details = (known after apply)
    }

  # module.postgres.google_sql_user.iam_account["backstage"] will be created
+ resource "google_sql_user" "iam_account" {
+       host                    = (known after apply)
+       id                      = (known after apply)
+       instance                = "backstage-dev"
+       name                    = (known after apply)
+       project                 = "bits-backstage-dev"
+       sql_server_user_details = (known after apply)
+       type                    = (known after apply)
    }

  # module.postgres.null_resource.module_depends_on will be created
+ resource "null_resource" "module_depends_on" {
+       id       = (known after apply)
+       triggers = {
+           "value" = "0"
        }
    }

  # module.postgres.random_password.user-password will be created
+ resource "random_password" "user-password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       keepers     = {
+           "name" = "backstage-dev"
        }
+       length      = 32
+       lower       = true
+       min_lower   = 1
+       min_numeric = 1
+       min_special = 0
+       min_upper   = 1
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>
Plan: 15 to add, 0 to change, 0 to destroy.

---